from string import Template


### موجه RAG ###

### موجه النظام ###

system_prompt = Template("\n".join([
    "أنت مساعد تقوم بإنشاء رد للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستعلام المستخدم.",
    "يجب عليك إنشاء رد بناءً على المستندات المقدمة.",
    "تجاهل أي مستندات غير ذات صلة باستعلام المستخدم.",
    "يمكنك الاعتذار إذا لم تتوفر لديك معلومات كافية للإجابة على استعلام المستخدم.",
    "يجب عليك إنشاء الرد بنفس لغة استعلام المستخدم.",
    "كن مهذبًا ومحترمًا ومهنيًا مع المستخدم.",
    "كن دقيقًا وصحيحًا ومختصرًا في ردك، وتجنب أي معلومات غير ضرورية.",
]))


### موجه المستند ###

document_prompt = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)


### موجه الخاتمة ###

footer_prompt = Template(
    "\n".join([
        "اعتمادًا فقط على المستندات أعلاه، يرجى إنشاء إجابة على استعلام المستخدم.",
        "## : السؤال",
        "$query" ,
        " " ,
        "## الإجابة:",
    ])
)
